import math
from typing import Tuple, List

SUBWAY_STATIONS = {
    "м. Аэропорт": (55.79981, 37.53412),
    "м. Академическая": (55.68808, 37.57501),
    "м. Алексеевская": (55.80737, 37.63844),
    "м. Александровский сад": (55.75219, 37.60836),
    "м. Алтуфьево": (55.89504, 37.58605),
    "м. Аннино": (55.581818, 37.594978),
    "м. Арбатская": (55.75228, 37.60357),
    "м. Авиамоторная": (55.75208, 37.71677),
    "м. Автозаводская": (55.70801, 37.65858),
    "м. Бабушкинская": (55.86814, 37.66292),
    "м. Багратионовская": (55.74326, 37.49753),
    "м. Баррикадная": (55.76027, 37.58111),
    "м. Бауманская": (55.77228, 37.67857),
    "м. Беговая": (55.77378, 37.54412),
    "м. Белорусская": (55.77492, 37.58207),
    "м. Беляево": (55.64371, 37.52762),
    "м. Бибирево": (55.88294, 37.60523),
    "м. Библиотека им. Ленина": (55.75211, 37.60988),
    "м. Битцевский парк": (55.60029, 37.55735),
    "м. Боровицкая": (55.75034, 37.60857),
    "м. Ботанический сад": (55.84649, 37.63914),
    "м. Братеево": (55.631363, 37.75174),
    "м. Братиславская": (55.66126, 37.7509),
    "м. Чеховская": (55.76596, 37.6075),
    "м. Черкизовская": (55.802, 37.74438),
    "м. Чертаново": (55.63978, 37.60893),
    "м. Чистые пруды": (55.76426, 37.6389),
    "м. Чкаловская": (55.756218, 37.659375),
    "м. Динамо": (55.78867, 37.55936),
    "м. Бульвар Дмитрия Донского": (55.567759, 37.575724),
    "м. Дмитровская": (55.80756, 37.57959),
    "м. Добрынинская": (55.72886, 37.62356),
    "м. Домодедовская": (55.61009, 37.71612),
    "м. Достоевская": (55.782438, 37.612747),
    "м. Дубровка": (55.719732, 37.676915),
    "м. Электрозаводская": (55.78177, 37.70471),
    "м. Шоссе энтузиастов": (55.75837, 37.75155),
    "м. Филевский парк": (55.73953, 37.48366),
    "м. Фили": (55.74673, 37.51384),
    "м. Фрунзенская": (55.72718, 37.58036),
    "м. Измайловская": (55.78768, 37.78329),
    "м. Улица Академика Янгеля": (55.596141, 37.59981),
    "м. Каховская": (55.65332, 37.59722),
    "м. Калужская": (55.65566, 37.53923),
    "м. Кантемировская": (55.6343, 37.65632),
    "м. Каширская": (55.65412, 37.64738),
    "м. Киевская": (55.74388, 37.56673),
    "м. Китай город": (55.753903, 37.635405),
    "м. Коломенское": (55.67745, 37.66298),
    "м. Комсомольская": (55.77717, 37.655689),
    "м. Коньково": (55.63253, 37.52005),
    "м. Кожуховская": (55.70533, 37.68508),
    "м. Красногвардейская": (55.614491, 37.744724),
    "м. Краснопресненская": (55.760109, 37.577141),
    "м. Красносельская": (55.780763, 37.666264),
    "м. Красные ворота": (55.76958, 37.6499),
    "м. Крестьянская застава": (55.732877, 37.668998),
    "м. Кропоткинская": (55.74525, 37.60463),
    "м. Крылатское": (55.75879, 37.40633),
    "м. Кунцевская": (55.73045, 37.44646),
    "м. Курская": (55.75848, 37.65985),
    "м. Кутузовская": (55.73947, 37.53433),
    "м. Кузьминки": (55.70531, 37.76775),
    "м. Кузнецкий мост": (55.76118, 37.62386),
    "м. Ленинский проспект": (55.70818, 37.58742),
    "м. Лубянка": (55.75876, 37.62573),
    "м. Люблино": (55.67694, 37.76316),
    "м. Марьина роща": (55.793602, 37.615762),
    "м. Марьино": (55.65193, 37.74771),
    "м. Марксистская": (55.7407, 37.65773),
    "м. Маяковская": (55.76909, 37.59635),
    "м. Медведково": (55.88594, 37.6612),
    "м. Менделеевская": (55.78251, 37.59792),
    "м. Минская": (55.731548, 37.491016),
    "м. Проспект мира": (55.781196, 37.633529),
    "м. Митино": (55.84589, 37.35909),
    "м. Молодежная": (55.74001, 37.41724),
    "м. Нагатинская": (55.68386, 37.62285),
    "м. Нагорная": (55.67283, 37.61019),
    "м. Нахимовский проспект": (55.66376, 37.60767),
    "м. Новые черемушки": (55.66892, 37.55417),
    "м. Новогиреево": (55.75111, 37.81564),
    "м. Новокосино": (55.740539, 37.856347),
    "м. Новокузнецкая": (55.74212, 37.62901),
    "м. Новослободская": (55.77921, 37.6009),
    "м. Охотный ряд": (55.75703, 37.61614),
    "м. Октябрьское поле": (55.793615, 37.493496),
    "м. Октябрьская": (55.729, 37.61139),
    "м. Орехово": (55.61214, 37.69584),
    "м. Отрадное": (55.86417, 37.60488),
    "м. Парк культуры": (55.73512, 37.59328),
    "м. Парк Победы": (55.736559, 37.512591),
    "м. Партизанская": (55.78962, 37.7479),
    "м. Павелецкая": (55.7313, 37.63612),
    "м. Печатники": (55.69252, 37.7295),
    "м. Перово": (55.75109, 37.78854),
    "м. Первомайская": (55.79342, 37.79979),
    "м. Петровско-Разумовская": (55.83712, 37.57349),
    "м. Пионерская": (55.73583, 37.46731),
    "м. Планерная": (55.85931, 37.43687),
    "м. Площадь Ильича": (55.745663, 37.681123),
    "м. Улица Подбельского": (55.81336, 37.73524),
    "м. Полежаевская": (55.77691, 37.51692),
    "м. Полянка": (55.73654, 37.61856),
    "м. Пражская": (55.61354, 37.60499),
    "м. Преображенская площадь": (55.79655, 37.71591),
    "м. Профсоюзная": (55.67822, 37.56381),
    "м. Пролетарская": (55.73171, 37.66726),
    "м. Пронская": (55.698344, 37.850869),
    "м. Пушкинская": (55.76565, 37.60417),
    "м. Речной вокзал": (55.85378, 37.47679),
    "м. Площадь Революции": (55.75646, 37.62321),
    "м. Рижская": (55.79222, 37.63557),
    "м. Римская": (55.746487, 37.682631),
    "м. Рязанский проспект": (55.71753, 37.79425),
    "м. Cавеловская": (55.79421, 37.58666),
    "м. Щелковская": (55.80955, 37.79884),
    "м. Щукинская": (55.80796, 37.46629),
    "м. Cеменовская": (55.78279, 37.71844),
    "м. Cерпуховская": (55.72658, 37.62462),
    "м. Cевастопольская": (55.65121, 37.59939),
    "м. Шаболовская": (55.71886, 37.60797),
    "м. Cходненская": (55.84937, 37.43951),
    "м. Cлавянский бульвар": (55.729508, 37.468829),
    "м. Cмоленская": (55.74823, 37.58384),
    "м. Cокол": (55.80518, 37.51495),
    "м. Cокольники": (55.78893, 37.67943),
    "м. Cпортивная": (55.72397, 37.56547),
    "м. Cретенский бульвар": (55.765551, 37.635261),
    "м. Cтрогино": (55.80435, 37.396363),
    "м. Cтуденческая": (55.73873, 37.54825),
    "м. Cухаревская": (55.77211, 37.63239),
    "м. Площадь Cуворова": (55.781984, 37.614487),
    "м. Cвиблово": (55.85543, 37.65419),
    "м. Таганская": (55.74255, 37.65389),
    "м. Театральная": (55.75857, 37.6177),
    "м. Текстильщики": (55.70947, 37.73282),
    "м. Теплый стан": (55.61814, 37.50814),
    "м. Тимирязевская": (55.81842, 37.57571),
    "м. Третьяковская": (55.74061, 37.62492),
    "м. Трубная": (55.767605, 37.6221),
    "м. Царицино": (55.62011, 37.66939),
    "м. Цветной бульвар": (55.7716, 37.62058),
    "м. Тульская": (55.70901, 37.6226),
    "м. Тургеневская": (55.7646, 37.63623),
    "м. Тушинская": (55.8258, 37.43621),
    "м. Тверская": (55.7652, 37.60352),
    "м. Улица 1905 года": (55.76355, 37.56375),
    "м. Университет": (55.69167, 37.53433),
    "м. Варшавская": (55.65381, 37.62084),
    "м. ВДНХ": (55.82177, 37.64107),
    "м. Проспект Вернадского": (55.67613, 37.5045),
    "м. Владыкино": (55.84669, 37.59251),
    "м. Водный стадион": (55.8386, 37.48749),
    "м. Войковская": (55.81811, 37.49905),
    "м. Волоколамская": (55.83459, 37.38367),
    "м. Волгоградский проспект": (55.7243, 37.68795),
    "м. Волжская": (55.69101, 37.75498),
    "м. Воробьёвы горы": (55.710454, 37.558601),
    "м. Выхино": (55.715, 37.81802),
    "м. Ясенево": (55.60535, 37.53494),
    "м. Юго-западная": (55.66464, 37.48421),
    "м. Южная": (55.62122, 37.60752),
}


def estimated_distance(
        loc_1: Tuple[float, float],
        loc_2: Tuple[float, float]
) -> float:
    """
    Определяет расстояние в пути между двумя точками

    :param loc_1: координаты первой точки (latitude, longitude)
    :param loc_2: координаты второй точки (latitude, longitude)

    :return: расстояние в пути между двумя точками (в метрах)
    """
    latitude1, longitude1 = loc_1
    latitude2, longitude2 = loc_2

    R = 6371  # Радиус Земли в километрах

    # Переводим градусы в радианы
    lat1_rad, lon1_rad, lat2_rad, lon2_rad = map(
        math.radians, [
            float(latitude1), float(longitude1), float(latitude2), float(longitude2)]
    )

    # Вычисляем разницу между широтами и долготами в радианах
    d_lat = lat2_rad - lat1_rad
    d_lon = lon2_rad - lon1_rad

    # Вычисляем расстояние между точками
    a = math.sin(d_lat / 2) ** 2 + math.cos(lat1_rad) * math.cos(lat2_rad) * math.sin(d_lon / 2) ** 2
    c = 2 * math.atan2(math.sqrt(a), math.sqrt(1 - a))
    d = R * c * 1000

    return d


def get_nearest_subway_stations(loc: Tuple[float, float], threshold: float) -> List[str]:
    stations = []
    for station, station_loc in SUBWAY_STATIONS.items():
        if estimated_distance(loc, station_loc) <= threshold:
            stations.append(station)
    return stations


def fix_address(address: str) -> str:
    address = address.replace("г. Москва", "город Москва")
    if ", город Москва" in address:
        fixed = address.split(", город Москва")[0]
    else:
        fixed = address
    if not fixed:
        fixed = address
    return fixed
